//Дано натуральное число, выведите его последнюю цифру.

#include <iostream>
using namespace std;
int main() {
  int a;
  cin >> a;
  cout << a % 10 << '\n';
  return 0;
}
