//Дано двузначное число. Выведите его первую цифру (число десятков)

#include <iostream>
using namespace std;
int main() {
  int x;
  cin >> x;
  cout << x / 10;
  return 0;
}
